#算术运算符  加、减、乘、除、整除（//）、取余/模(%)、幂指数(**)
print("10+4=",10+4)
print("12除以4=",12/4)
print("10取模4=",10%4)
print("12乘4=",12*4)
print("12-4=",12-4)
print("4的4次方=",4**4)
# 算术运算符的优先级-- > ** -- >* / // % -- > +
#例
print("0.1 + 10 / 4 ** 2 =", 0.1 + 10 / 4 ** 2)
# 案例:输入两个数 x 和y,计算x+y 以及x-y 的结果并输出
x= int(input("请输入x的值:"))
y=int(input("请输入y的值:"))
print("x + y =",x+y)
print("x - y =",x-y)





#逻辑运算符  and、or、not    用于连接多个条件(布尔)表达式(其值为“真”或“假”),并返回一个最终布尔结果的运算符
# 案例1:键盘输入一个整数,判断这个数字是否在 10-20 之间 -- >在:True,不在:False
n= int(input("请输入一个整数:"))
print(f"{n}是否在10-20之间？",n>= 10 and n <= 20)

# 案例2:键盘输入一个整数,判断这个数字是否不在10-20之间
m= int(input("请输入一个整数："))
print(f"{m}是否不在10--20之间？",m<=10 or m>=20)





#比较运算符  (==!= > >= <<=)  注：返回的是布尔值
print("100 == 100 [4 : ", 100 == 100)#True
print("'100' == '100' [4 : ", "100" == "100")#True
print("100 != 100 [4 : ", 100 != 100)#False
print("100 < 100 [4 : ", 100 < 100)#False
print("100 <= 100 [4 : ", 100 <= 100) #True
print("100 > 100 [4 : ", 100>100)#False
print("100 >= 100 [4 : ", 100 >= 100) #True






#赋值运算符(赋值运算符是编程语言中用于将值(或表达式的结果)保存到变量中的运算符。(把右边的值,赋给左边的变量))
#  = += -= *= /=%=// =**=
num = 85
num += 10 # num = num + 10
print("num += 10后, num = ", num)
num -= 10 # num = num - 10
print("num -= 10后, num = ", num)
num *= 10 # num = num * 10
print("num *= 10后, num = ", num)
num /= 10 # num = num / 10
print("num /= 10后, num =", num)
num //= 10 # num = num // 10
print("num //= 10后, num =", num)
num %= 3 # num = num % 3
print("num %= 3后, num = ", num)
num **= 3 # num = num ** 3
print("num **= 3后, num = ", num)